In [14]:
import pandas as pd
df=pd.read_csv('stock market.csv', na_values={
    'eps':['not available','n.a.'],
    'revenue':['not available','n.a.',-1],
    'people':['not available','n.a.']
})
df

   ticker    eps  revenue price         people
0  GOOGLE  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [16]:
df.to_csv('new.csv', index=False)

In [17]:
df.columns

Index(['ticker', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [19]:
df.to_csv('new.csv',header=False)

In [21]:
df=pd.read_excel('stock market.xlsx')
df

  tickers            eps  revenue price         people
0  GOOGLE          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [24]:
def convert_people_cell(cell):
    if cell=='n.a.':
        return 'sam walton'
    return cell

def convert_eps_cell(cell):
    if cell=='not available':
        return None
    return cell

df=pd.read_excel('stock market.xlsx', converters={
    'people':convert_people_cell,
    'eps':convert_eps_cell
})
df

  tickers    eps  revenue price         people
0  GOOGLE  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3     RIL    NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

In [27]:
df.to_excel('New.xlsx',sheet_name='stocks',startrow=1,startcol=2,index=False)

In [28]:
df_stocks=pd.DataFrame({
    'tickers':['GOOGLE','WMT','MSFT'],
    'price':[845,65,64],
    'pe':[30.67,14.26,30.97],
    'eps':[27.82,4.61,2.12]
})

df_weather=pd.DataFrame({
    'day':['1/1/2017','1/2/2017','1/3/2017'],
    'temperature':[32,35,28],
    'event':['Rain','Sunny','Snow']
})

In [29]:
with pd.ExcelWriter('stocks weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name='stocks')
    df_weather.to_excel(writer, sheet_name='weather')